import cityInfos from '../data/position_old.json';
import info from '../data/info.json'; // {起点站：{到达站：{跳数，价格，时间}}}
import sumInfo from '../data/sumInfo.json'; // {起点站：Set(重点站)}
import { fdeb } from './fdeb';

// dyk 经过bundling的绘制数据
export function findAllConnectionsFDEB() {
  let nodes = {};
  let edges = [];
  // Object.keys(sumInfo).forEach(siteName => {
  //   console.log(siteName);
  // });
  Object.keys(sumInfo).forEach(siteName => {
    // console.log(sumInfo[siteName]);
    // 增加节点
    if (!nodes.hasOwnProperty(siteName)) {
      if (!cityInfos[siteName]) {
        // 找不到坐标，则忽略此站
        console.log('找不到', siteName);  // 找不到遵义西和唐山南，这两个先直接用遵义和唐山代替
      }
      nodes[siteName] = {
        x: (cityInfos[siteName] || '').latitude,  // todo 有的站找不到坐标
        y: (cityInfos[siteName] || '').longitude
      };
    }
    // 增加边
    sumInfo[siteName].forEach(destSiteName => {
      if (!sumInfo.hasOwnProperty(destSiteName)) {
        // 找不到目标车站，先直接不要了
        console.log('找不到目标站', destSiteName);
        return;
      }
      if (edges.hasOwnProperty(destSiteName)) {
        // 如果目标车站已经在nodes列表中了，则删除
        return;
      }
      edges.push({
        source: siteName,
        target: destSiteName
      });
    });
  });

  console.log(nodes, edges);

  // const positions = (fdeb().nodes(nodes).edges(edges.slice(20)))();

  // 测试数据
  var node_data = {
    "0":{"x":922.24444, "y":347.29444},
    "1":{"x":814.42222, "y":409.16111},
    "2":{"x":738, "y":427.33333000000005},
    "3":{"x":784.5, "y":381.33333},
    "4":{"x":1066.09167, "y":350.40278},
    "5":{"x":925.4861099999999, "y":313.275}
  };

  var edge_data = [{"source":"0", "target":"1"}, {"source":"4", "target":"2"}, {"source":"0", "target":"3"}, {"source":"0","target":"4"}, {"source":"2", "target":"5"}, {"source":"3", "target":"2"}, {"source":"3", "target":"4"}];



  // node_data = {
  //   "1": { x: "45.2080", y: "127.961751" },
  //   "2": { x: "36.82981", y: "101.95194" },
  //   "3": { x: "24.99827", y: "109.99898" }
  // };
  //
  // edge_data = [
  //   {
  //     source: "1",
  //     target: "2"
  //   },
  //   {
  //     source: "1",
  //     target: "3"
  //   }
  // ];


  console.log(nodes, edges);

  // let fbundling = fdeb()
  //   .step_size(0.0001)
  //   .compatibility_threshold(0.6)
  //   .nodes(nodes)
  //   .edges(edges.slice(0, 2));

  let fbundling = fdeb()
    .step_size(0.02)
    .compatibility_threshold(0.6)
    .nodes(node_data)
    .edges(edge_data);

  let results = fbundling();
  return results.flatMap(x => x);
}


/**
 *
 * @returns {[]}
 */
export function findAllConnections() {
  const res = [];
  for (const start of Object.keys(sumInfo)) {
    for (const end of sumInfo[start]) {
      res.push([findPosition(start), findPosition(end)]);
    }
  }
  return res;
}

export function findDestinationByScale(startPos, scale, dimension = 'step', res) {
  for (const endPos of Object.keys(info[startPos])) {
    if (info[startPos][endPos][dimension] <= scale && info[startPos][endPos][dimension] !== 0 && !res.has(endPos)) {
      res.add(endPos);
      findDestinationByScale(endPos, scale - info[startPos][endPos][dimension], dimension, res);
    }
  }
  return res;
}

export function findPartialConnections(startPos, scale, dimension = 'step') {
  const des = new Set();
  findDestinationByScale(startPos, scale, dimension, des);
  const res = [];
  for (const endPos of des) {
    res.push([findPosition(startPos), findPosition(endPos)]);
  }
  return res;
}

export function findLayerByScaleBFS(startPos, scale, dimension = 'step') {
  const res = { name: startPos, value: 0, children: [] };
  const set = new Set();
  const queue = new Queue();

  queue.enqueue([res, startPos, 0]);
  set.add(startPos);
  while (!queue.isEmpty()) {
    const v = queue.dequeue();
    const v_tree = v[0]; const v_id = v[1];
    const accumulate_val = v[2];
    // console.log(v_id);
    if (info[v_id] === undefined) continue;
    for (const nextPos of Object.keys(info[v_id])) {
      const value = info[v_id][nextPos][dimension];
      if (value !== 0 && accumulate_val + value <= scale && !set.has(nextPos)) {
        const t_res = { name: nextPos, value: accumulate_val + value, children: [] };
        v_tree.children.push(t_res);
        queue.enqueue([t_res, nextPos, accumulate_val + value]);
        set.add(nextPos);
      }
    }
  }
  return res;
}

export function findLayerByScale(startPos, scale, dimension = 'step', set) {
  const res = {};
  res.name = startPos;
  res.children = [];
  set.add(startPos);
  for (const nextPos of Object.keys(info[startPos])) {
    if (info[startPos][nextPos][dimension] <= scale && info[startPos][nextPos][dimension] !== 0 && !set.has(nextPos)) {
      res.children.push(findLayerByScale(nextPos, scale - info[startPos][nextPos][dimension], dimension, set));
    }
  }
  return res;
}

export function findLayerConnections(startPos, scale, dimension = 'step') {
  const set = new Set();
  return findLayerByScale(startPos, scale, dimension, set);
  // return findLayerByScaleBFS(startPos, scale, dimension);
}

// export function findPosition(city) {
//   // if (cityInfos.hasOwnProperty(city)) return [parseFloat(cityInfos[city].longitude), parseFloat(cityInfos[city].latitude)];
//   // 段段修改，调整经纬度
//   if (cityInfos.hasOwnProperty(city)) return [parseFloat(cityInfos[city].latitude), parseFloat(cityInfos[city].longitude)];
//   return [-1, -1];
// }

export function findPosition(city) {
  const cs = ["北京","唐山北","北戴河","沈阳","沈阳南","蓟州","葫芦岛北","锦州南","盘锦北","山海关","沈阳北","绥中北","台安","秦皇岛","辽中","公主岭南","长春","铁岭西","四平东","吉林","蛟河西","敦化","安图西","延吉西","图们北","珲春","长春西","扶余北","哈尔滨西","宾州","方正","高楞","依兰","佳木斯","东戴河","德惠西","哈尔滨","肇东","安达","大庆东","齐齐哈尔南","盘锦","营口东","鲅鱼圈","大连北","瓦房店西","盖州西","普湾","滦县","鞍山西","辽阳","通辽","海城西","开原西","昌图西","大明湖","淄博","潍坊","青岛北","沧州","南京","苏州","上海","镇江","天津西","嘉兴","杭州","德州","海宁","唐山","曹妃甸东","曹妃甸港","阿城","尚志","一面坡","苇河","亚布力","横道河子","海林","牡丹江","徐州","宿州","蚌埠","合肥","天津","锦州","白城","齐齐哈尔","大庆西","常州","无锡","保定","石家庄","邢台","邯郸","鹤壁","郑州","许昌","漯河","信阳","武昌","岳阳","长沙","株洲","醴陵","萍乡","宜春","新余","樟树","丰城","南昌","沭阳","淮安","阜宁","盐城","泰州","铁岭","四平","山市","燕郊","玉田县","昌黎","通州","乔庄东","北京西","北京东","三家店","官厅西","沙城","下花园","宣化","张家口南","廊坊北","杨村","静海","青县","泊头","东光","吴桥","济南","泰山","磁窑","兖州","邹城","滕州","枣庄西","滁州北","通州西","密云北","兴隆县","鹰手营子","承德","下板城","平泉","凌源","叶柏寿","公营子","朝阳南","北票南","义县西","阜新南","新立屯","本溪","小市","五女山","通化","西柳","海城","鞍山","兴城","葫芦岛","沟帮子","大虎山","抚顺北","清原","梅河口","辽源","塘沽","芦台","凤凰城","丹东","公主岭","鸡西","柴沟堡","大同","丰镇","集宁南","呼和浩特东","萨拉齐","包头","临河","乌海","惠农","石嘴山","银川","青铜峡","中宁","中卫","武威","金昌","山丹","张掖","酒泉","嘉峪关","玉门","瓜州","敦煌","芜湖","宣城","绩溪县","黄山","祁门","景德镇","乐平市","鹰潭","资溪","光泽","邵武","顺昌","南平南","福州","阳高","包头东","绥中","新民","苏家屯","大石桥","熊岳城","瓦房店","普兰店","金州","大连","马鞍山","广德","长兴南","德清西","诸暨","义乌","金华南","武义","永康","缙云","丽水","青田","温州","定州","临城","沙河市","安阳","汤阴","卫辉","新乡","宝丰","南阳","黄村","朝阳镇","磐石","明城","蛟河","安图","延吉","图们","天镇","呼和浩特","三河县","哈尔滨东","兴隆镇","绥化","绥棱","海伦","通北","北安","禹城","烟台","庆安","铁力","朗乡","带岭","南岔","浩良河","香兰","汤原","扶余","呼兰","卓资东","乌拉特前旗","五原","巴彦高勒","乌海西","威海","西丰","东丰","柳河","高碑店","徐水","焦作","济源","汝州","鲁山","邓州","襄阳","荆门","石门县北","慈利","张家界","吉首","怀化","玉屏","镇远","贵阳","六盘水","宣威","曲靖","昆明","彰武","镇赉","泰来","富裕","小榆树","拉哈","讷河","伊拉哈","九三","嫩江","达拉滨","大杨树","春亭阁","白桦排","加格达奇","白涧","灵丘","五台山","繁峙","代县","原平","忻州","太原东","太原","涞源","平遥","介休","霍州","洪洞","临汾","侯马","闻喜","运城","任丘","肃宁","深州","辛集","石家庄北","阳泉北","榆次","太谷","灵石","襄汾","新绛","稷山","河津","韩城","衡水","枣强","清河城","临清","聊城","青州市","高密","青岛","兰州","兰州西","凌海","应县","山阴","祁县","涿州","驻马店","益阳","常德","临澧","松原","怀柔北","滦平","隆化","四合永","纪家沟","赤峰","奈曼","八仙筒","高林屯","宝龙山","敖力布告","太平川","通榆","黑水","洮南","乌兰浩特","迁安","抚宁","双辽","保康","富拉尔基","碾子山","扎兰屯","南木","沟口","博克图","免渡河","牙克石","大雁","海拉尔","乌固诺尔","完工","扎赉诺尔西","满洲里","德惠","陶赖昭","双城堡","五家","菏泽","商丘","砀山","邳州","新沂","东海县","连云港","商河","阳信","滨州","利津南","东营南","郓城","巨野","嘉祥","济宁","曲阜","泗水","平邑","费县","临沂","日照","霸州","正定","怀柔","杨柳青","扬州","海安","如皋","南通","阜阳","武夷山","九江","抚州","泰宁","三明北","九台","灵璧","泗县","洋河","泗阳","莒南","霍邱","上海南","饶阳","二连","胶州","桃村","乳山","文登","滦河","胜芳","白沟","商丘南","淮滨","潢川","光山","新县","麻城","汉口","对青山","宋","尚志南","苇河西","亚布力西","滨海西","北京南","通远堡西","沧州西","济南西","曲阜东","枣庄","徐州东","蚌埠南","南京南","镇江南","常州北","无锡东","苏州北","上海虹桥","泰安","定远","丹阳北","嘉兴南","杭州东","武义北","永康南","缙云西","温州南","苍南","滨海北","军粮城北","德州东","昆山南","天津南","霸州西","保定东","高邑西","邢台东","邯郸东","安阳东","新乡东","郑州东","郑州西","洛阳龙门","西安北","佛坪","汉中","广元","江油","德阳","成都东","太原南","济南东","邹平","淄博北","青州市北","潍坊北","高密北","青岛西","董家口","日照西","岚山西","赣榆","齐河","即墨北","莱阳","烟台南","牟平","白洋淀","定州东","平原","晏城","昆山","玉泉","平山","开原","甘旗卡","昌图","阳谷","梁山","定陶","亳州","黄州","蕲春","向塘","吉安","衡阳","祁阳","永州","东安东","全州南","桂林北","柳州","来宾","黎塘","南宁","南昌西","赣州","韶关东","广州","佛山","肇庆","茂名","湛江西","徐闻","海口","南芬北","凤城东","本溪新城","五龙背东","东港北","大孤山","庄河北","皮口","青堆","花园口","登沙河","北井子","城子坦","杏树屯","林口","双城北","阿城北","帽儿山西","横道河子东","海林北","杜尔伯特","鹤壁东","许昌东","漯河西","驻马店西","信阳东","孝感北","武汉","赤壁北","岳阳东","长沙南","永城北","砀山南","开封北","新民北","阜新","北票","朝阳","牛河梁","平泉北","承德南","喀左","承德县北","黑山北","八面城","江桥","二道湾","团结","六合镇","老莱","哈力图","红彦","朝阳村","讷尔克气","灯塔","张台子","义县","凌源东","三十家","杨树岭","小寺沟","茂林","盖州","四方台","张维屯","东边井","海北","李家","赵光","克东","克山","依安","塔哈","五大连池","龙镇","襄河","孙吴","黑河","许家屯","顺义","郭家店","哈尔滨北","嵯岗","大杨树东","乌鲁布铁","加南","穆棱","绥阳","绥芬河","林盛堡","老边","营口","吴家屯","陈相屯","姚千户屯","歪头山","石桥子","威宁","南芬","下马塘","连山关","祁家堡","草河口","通远堡","长虹","中兴","大堡","铁佛寺","边沟","佟家","庙阳","天桥","灌水","龙爪沟","宽甸","永甸","长甸","兰家屯","马三家","沙岭","绍兴","上虞","宁波","烟筒山","大庆","蓝村","牛庄","新开","民权","兰考","开封","双丰","桃山","神树","福利屯","双鸭山","南杂木","山城镇","三源浦","界山","威岭","鹤岗","西林","美溪","伊春","大营镇","十堰","安康","紫阳","宣汉","达州","渠县","广安","重庆","晨明","莲江口","大安北","新肇","太阳升","立志","新华屯","林源","银浪","莱西","徐家店","查布嘎","林东","大板","林西","经棚","桑根达来","正镶白旗","化德","商都","洛阳","灵宝","潼关","渭南","西安","关林","凯里","福泉","安顺","六枝","农安","王府","长山屯","大安","两家","平台","镇西","新邱","清河门北","黄泥河","偏岭镇","岫岩","兴隆店","大红旗","绕阳河","励家","高山子","东辛庄","天义","平庄","元宝山","苍石","白山市","氡泉","黄泥崴子","松江河","泉阳","北岗","露水河","白河","松江镇","荒沟西","枕头峰","十里坪","和龙","龙井","松树","章党","江源","湾沟","松树镇","仙人桥","深井子","李石寨","大官屯","草市","双河镇","口前","三江口","金宝屯","大林","温泉寺","大阳","八里甸子","扎鲁特","白音胡硕","霍林郭勒","小东","阿金","周家屯","上园","阿尔山","铁刹山","通化县","羊圈子","索伦","五叉沟","溧阳","宜兴","湖州","绍兴北","宿州东","滁州","正定机场","华山北","渭南北","朝天","绵阳","重庆西","三门峡南","曹县","武穴","湘潭","娄底","涟源","新化","溆浦","蔡家沟","郴州","广州东","瑞金","龙岩","漳州","厦门北","井冈山","东方","三亚","咸宁北","交城","文水","汾阳","吕梁","延安","咸阳","杨陵","宝鸡","秦岭","凤县","两当","徽县","略阳","阳平关","成都","龙川","河源","惠州","东莞东","昂昂溪","龙江","孝感","兰棱","开鲁","柳园","哈密","吐鲁番北","乌鲁木齐","胜利镇","奈林皋","台前","偃师","义马","三门峡","高邑","巩义","新安县","渑池","西安南","镇安","南充","遂宁","云梦","安陆","随州","枣阳","王岗","绥德","靖边","定边","谭家井","疏勒河","鄯善","吐鲁番","泡子","海石湾","乐都","西宁","柳林南","吴堡","清涧县","子长","富县东","蒲城东","深圳","廊坊","广水","咸宁","赤壁","丹阳","卢龙","乾安","烟筒屯","一面坡北","米沙子","沃皮","五棵树","榆树","新立镇","谢家镇","舒兰","龙嘉","大石头南","双吉","九台南","开安","查干湖","安广","到保","葛根庙","哈拉海","华家","布海","达家沟","姚家","卡伦","土们岭","左家","亚复","大口钦","前窑","丰广","吉舒","东富","大屯","范家屯","陶家屯","治安","敖汉","四道湾","阿尔山北","伊敏","双阳","伊通","建安","棋盘","平安","山河屯","江密峰","天岗","六道河","老爷岭","小姑家","白石山","黄松甸","大石头","哈尔巴岭","茶条沟","榆树川","桦皮厂","五常","平房","香坊","宾西北","宏克力","新香坊北","达连河","双龙湖","得莫利","佳木斯西","永胜","四马架","太平镇","丰乐镇","笔架山","升昌","红兴隆","新友谊","富锦","向阳川","建三江","换新天","前进镇","鹤立","新华","峻德","五林","宁安","东京城","长发屯","申家店","孟家岗","桦南","杏树","大西","勃利","通天屯","佛岭","虎山","青山","亚河","古城镇","向阳","楚山","宝林","朱家沟","柴河","柳树","金山屯","苔青","双子河","友好","红山","五营","红星","新青","汤旺河","乌伊岭","宝清","抚远","宝泉岭","鹤北","兴莲","望江","绿潭","圣浪","洪河","前锋","东二道河","寒葱沟","石人城","康金井","同江","半截河","徐家","双柳","九营","双龙山","倭肯","互助","七台河","哈拉苏","巴林","塔河","阿木尔","漠河","新林","盘古","聂河","图强","万乐","里木店","尚家","羊草","成吉思汗","高台子","帽儿山","鸡东","密山","虎林","迎春","东方红","兴安岭","西岭口","乌奴耳","哈克","阿里河","吉文","甘河","克一河","喀喇其","伊图里河","根河","岭北","岭南","库都尔","原林","岩山","乌尔旗汗","煤田","牧原","青水山","哈达阳","沈家","白奎堡","松青","万发屯","姜家","安平","寒岭","西六方","余粮堡","太平庄","瓦房","东来","嘎什甸子","东明村","敖来","黄花筒","白音他拉","昂乃","嘎什吐","舍力虎","四合","新窝铺","三义井","木头营子","莲花山","小河沿","山湾子","风水沟","安庆沟","水地","东南营子","赤峰东","钱家店","门达","欧里","曲家店","大青沟","三家子","库伦","东胜西","榆林","万源","昌平北","古北口","舍伯吐","吐列毛杜","西哲里木","哈日努拉","珠斯花","张掖西","临泽南","酒泉南","嘉峪关南","柳园南","吐哈","鄯善北","岷县","陇南","苍溪","南部","南充北","重庆北","阆中","平安驿","高台南","民乐","渭源","哈达铺","漳县","姚渡","陇西","甘谷","天水","定西","白银西","石河子","沙湾县","奎屯","精河南","伊宁","西峡","内乡","镇平","当阳","松滋","武威南","鄂州","黄石","庐山","商洛","丹凤","罗山","息县","商城","固始","清水","武山","天祝","中川机场","兰州新区","西固","景泰","察素齐","夏官营","许家台","甘草店","李家坪","通安驿","陈官营","西固城","坡底下","河口南","龙泉寺","永登","打柴沟","龙沟","古浪","黄羊镇","水源","邵家堂","皋兰","丰水村","朱家窑","红砂岘","红岘台","兴泉堡","长城","营盘水","干塘","阜南","浠水","深圳西","高台","焉耆","库尔勒","轮台","库车","新和","阿克苏","阿图什","喀什","虢镇","蔡家坡","武功","临泽","长葛","临颍","西平","确山","英德","商南","唐河","桐柏","巢湖","兴平","马兰","和硕","巴楚","乌苏","淮南","武胜","合川","涪陵","武隆","彭水","黔江","铜仁","靖州","牙屯堡","三江县","融安","融水","罗城","低窝铺","秀山","源潭","三门峡西","虞城县","夏邑县","余姚","宁陵县","连云港东","遵义","清水县","张家川","安口窑","平凉","固原","同心","泾川","长庆桥","德令哈","格尔木","那曲","拉萨","莆田","安多","襄州","天水南","宝鸡南","杨陵南","咸阳秦都","襄汾西","临汾西","介休东","平遥古城","定西北","秦安","东岔","大通西","岐山","门源","清水北","湟源","海晏","哈尔盖","刚察","鸟岛","天棚","乌兰","柯柯","连湖","饮马峡","锡铁山","达布逊","察尔汗","马海","乌鲁木齐南","柳树泉","七泉湖","达坂城","晋州","玛纳斯","英吉沙","莎车","叶城","皮山","墨玉","和田","克拉玛依","铁厂沟","额敏","塔城","霍尔果斯","双河市","博尔塔拉","鱼儿沟","阿克陶","泽普","昆玉","阿拉山口","金银川","尼勒克","和什托洛盖","福海","北屯市","阿勒泰","四棵树","霍城","魏家泉","准东","小岭","成高子","西麻山","黑台","八虎力","磨刀石","下城子","八面通","梨树镇","石磷","柳毛","东海","连珠山","密山西","裴德","兴凯","杨岗","凯北","卫星","桦林","杨木","奎山","麻山","青龙","兰岭","滴道","拉古","敖头","长汀镇","温春","兰岗","永安乡","石头","马莲河","斗沟子","南宁东","广州南","钦州东","合浦","北海","永福南","三江南","从江","都匀东","龙里北","贵阳东","綦江东","内江北","资中北","资阳北","宾阳","来宾北","鹿寨北","桂林","五通","榕江","遵义南","桐梓北","贵定县","桐梓东","赶水东","大足南","隆昌北","三都县","龙洞堡","贵港","桂平","平南南","藤县","梧州南","郁南","云浮东","肇庆东","佛山西","贵阳北","南江口","三水南","中山","珠海","防城港北","田阳","百色","田东北","隆安东","平果","富宁","普者黑","弥勒","昆明南","楚雄","南华","大理","广南县","珠琳","广通北","祥云","禄丰南","石林西","祁东","衡阳东","丽江","恭城","钟山西","贺州","阳朔","兴业","玉林","兴安北","贵溪","上饶","衢州","金华","深圳北","香港西九龙","株洲西","新余北","鹰潭北","松江南","萍乡北","玉山南","长兴","高安","进贤南","龙游","合肥南","萧县北","抚州东","武夷山北","武夷山东","建瓯西","南平北","江山","乐清","温岭","台州","剑门关","城固北","阿房宫","虎门","陆川","文地","河唇","廉江","遂溪","湛江","博白","高碑店东","新会","阳江","涿州东","潮汕","普宁","惠州南","桂林西","娄山关南","珞璜南","璧山","广宁","息烽","潼南","怀集","修文县","永川东","荣昌北","长寿湖","垫江","梁平南","万州北","开平南","马踏","电白","中山北","明珠","台山","恩平","阳西","吴川","小榄","阳东","双水镇","韶关","耒阳西","郴州西","衡山西","福田","汨罗东","清远","乐昌东","兰考南","广州北","英德西","明港东","庆盛","醴陵东","德安","婺源","黄山北","绩溪北","泾县","铜陵北","无为","巢湖东","麻城北","六安","灵宝西","渑池南","天门南","荆州","宜昌东","枝江北","潜江","金寨","黄冈东","汉川","恩施","利川","仙桃西","弋阳","鲘门","葵潭","潮阳","泉州","红安西","淮南东","辛集南","衡水北","平原东","禹城东","盘州","曲靖北","富源北","邵阳","怀化南","芷江","新晃西","铜仁南","凯里南","深圳坪山","汕尾","汕头","西渡","邵东","隆回","洞口","安江东","韶山南","娄底南","新化南","湘潭北","邵阳北","杨桥","邵阳西","双峰北","光明城","陆丰","惠东","揭阳机场","揭阳","丰顺东","梅州西","建桥","畲江北","顺德","江门东","古镇","容桂","顺德学院","南头","北滘","南朗","唐家湾","珠海北","前山","东升","碧江","宁强南","鄠邑","安顺西","贵定北","三穗","余杭","桐乡","嘉善南","平坝南","嵩明","溆浦南","关岭","玉溪","德清","民权北","普安县","南城","建宁县北","将乐","尤溪","永泰","厦门","闽清北","永安南","漳平西","南靖","余姚北","宁海","溧水","永嘉","雁荡山","三门县","洋县西","简阳南","朱砂古镇","成都南","双流机场","彭山北","眉山东","乐山","峨眉山","洛湾三江","百宜","南江","开阳","葛店南","黄石北","阳新","永修","南丰","平顶山","瑞昌","零陵","道州","江永","江华","梧州","大冶北","通渭","瑞昌西","巩义南","湖口","景德镇北","都昌","鄱阳","千岛湖","桐庐","富阳","新郑机场","武陟","南阳寨","修武西","黄河景区","华山","黄口","鄄城","晋城","高平","长治","长治北","沁县","武乡","榆社","长垣","东明县","华蓥","建阳","建瓯","古田","洛阳东","花园","南召","谷城","武当山","西乡","胶州北","澧县","麻阳","白河东","营山","蓬安","陇县","周口","衡山","雷州","湘乡","长汀南","大英东","海门","启东","汨罗","耒阳","郯城","临沂东","沂南","沂水","莒县","五莲","诸城","土贵乌拉","东莞","深圳东","濮阳","万州","梁平","冷水江东","旬阳","石泉县","白沙铺","临淄北","桃村北","枫林","建德","涪陵北","滕州东","海阳北","巴东","共青城","五府山","古田北","福州南","全椒","石柱县","建始","丰都","长寿北","瓦屋山","绍兴东","江宁","安亭北","无锡新区","惠山","戚墅堰","苏州新区","姜堰","漳浦","云霄","诏安","饶平","歙县北","黄冈西","黄冈","天河机场","孝感东","南湖东","汤逊湖","庙山","普安","土地堂东","贺胜桥东","横沟桥东","咸宁南","纸坊东","京山","钟祥","临海","毛陈","闵集","金银潭","天河街","槐荫","后湖","嘉善","松江","应城","涡阳","淮北","项城","沈丘","月山","怀仁东","襄阳东","华容南","鄂州东","花湖","奉化","水家湖","花山南","左岭","华容东","德兴东","开化","常山","开江","樟树东","新干","泰和","兴宁","梅州","丰顺","揭阳南","潮州","兴国","于都","进贤","东乡","玉山","天门","米脂","南昌","海宁西","三明","宁德","太姥山","瑞安","南陵","延平西","双洋","丰城南","峡江","信丰","龙南","定南","仙游","惠安","晋江","福鼎","绅坊","厦门","霞浦","雁石南","古田会址","连江","罗源","福安","冠豸山","德兴","金山北","施秉","福州南","福清","角美","涵江","旌德","长临河","大荔","闻喜西","洪洞西","霍州东","太谷西","永济北","运城北","江油北","罗江东","广汉北","青川","新都东","青莲","青白江东","灵石东","祁县东","侯马西","晋中","忻州西","原平西","榆中","黄陵南","甘泉北","石家庄东","夏格庄","文登东","荣成","章丘北","句容西","绿博园","宋城路","乐昌","固镇","安庆西","天柱山","太湖","宿松","安化","黄梅","铜陵","池州","枣庄东","太和北","界首市","庐江","桐城","分宜","岑溪","容县","北流","子洲","盐池","宁东","鄂尔多斯","苏州园区","龙山镇","江都","仙林","花桥","上海西","宝华山","万年","和平","彭泽","鹿寨","东至","颍上","三堂集","栟茶","如东","江宁西","马鞍山东","弋江","安庆","当涂东","繁昌西","阳澄湖","南翔北","合肥北城","三阳","平阳","淮北北","香港红磡","长征","贵定","藁城","威海北","景州","藁城南","昌乐","蓬莱市","龙口市","博兴","东营","临邑","陵城","南仇","黑旺","源迁","南博山","常庄","莱芜东","蔺家楼","司家岭","范镇","燕家庄","上高镇","龙市","炎陵","茶陵南","安仁","响水县","滨海港","阜宁东","射阳","盐城北","平度","兰陵北","武清","蓬溪","岳池","广安南","沙坪坝","复盛","双流西","峨眉","新津南","青神","新津","犍为","宜宾西","屏山","泥溪","辰溪","都匀","独山","麻尾","金城江","三汇镇","平昌","巴中","会同","通道","化州","茂名西","洛碛","长寿","白涛","白沙沱","白马","中嘴","高谷","保家楼","郁山","干溪沟","核桃园","鱼泉","长潭沟","泔溪","酉阳","龙池","松桃","坪石","枝城","宜城","庄桥","宜州","旬阳北","白河县","田林","兴义","威舍","罗平","师宗","新晃","阳春","横峰","大余","南雄","始兴","永定","红果","富源","大埔","会昌北","常平","武安","磁山","阳邑","井店","涉县","黎城","潞城","龙华","滨海","兰溪","达拉特西","朝天南","燕子砭","白水江","宏庆","凤州","大兴机场","北京大兴","大灰厂","上万","南观村","燕山","良各庄","孤山口","云居寺","三合庄","十渡","平峪","野三坡","百里峡","福山口","板城","南城司","奇峰塔","紫荆关","大盘石","塔崖驿","王安镇","浮图峪","北屯","小西庄","艾河","招柏","云彩岭","大涧","攀枝花","获嘉","灵武","下台子","元氏","石林","南丹","册亨","高州","信宜","三水","南宁西","云南驿","鹤庆","建水","蒙自","通海","屏边","河口北","曲江","临湘","路口铺","阳曲西","张兰","清徐","宁武","朔州","岱岳","怀仁","小河镇","遂平","攸县南","扶绥","崇左","宁明","凭祥","渠旧","濑湍","亭亮","宜良北","富川","双牌","德保","靖西","三水北","大旺","鼎湖东","端州","狮山","四会","鼎湖山","狮山北","云东海","丹霞山","樟木头","平湖","低庄","宁乡","小池口","孔垄","余江","阳曲","柳沟","桥湾","乌龙泉南","山坡东","咸宁东","金山卫","新桥","亭林","车墩","春申","叶榭","金山园区","小哨","杨林","小新街","照福铺","吴官田","马龙","白沙坡","平河口","白水镇","车转湾","羊尾哨","平关","沙沱","花家庄","平田","盘关","月亮田","柏果","松河","雨格","三家寨","茅草坪","营街","发耳","都格","白鸡坡","玉舍","元谋","黄瓜园","红江","大湾子","师庄","新江","花棚子","拉鲊","迤资","王家营西","广南卫","七甸","施家嘴","永丰营","乐善村","班猫箐","石林南","茂舍祖","西街口","宜耐","陆良","秧草地","长坡岭","中寨","羊者窝","芦沟","江所田","小得江","岔江","革居","大田边","新坪田","瓦窑田","小雨谷","威箐","鲁番","上西铺","宁国","草海","昭通","西昌","黄陵","孙镇","蒲城","钟家村","张桥","神木","锦界","毛坝","高滩","大竹园","渡市","石梯","古城","扎音河","高头","冯屯","中和","富海","二井","二龙山屯","辰清","西岗子","三间房","汤池","平洋","榆树屯","喇嘛山","雅鲁","赫尔洪得","光明","八方","恒地营","弯道","鹤山","新高峰","新彦","松树林","翠峰","小扬气","古源","劲松","新天","太阳沟","塔源","大乌苏","碧州","翠岗","塔尔根","绣峰","瓦拉干","古莲","大民屯","大兴","红旗营","虎尔虎拉","鲁河","吉新河","歙县","无为南","龙桥","舒城","南堡北","唐海南","天津北","曹子里","崔黄口","大口屯","宝坻","下仓","上仓","蓟州北","乌兰察布","托克托东","东胜东","准格尔","赵城","陶思浩","美岱召","公积坂","东兴","民族","旗下营","三道营","福生庄","卓资山","姑家堡","马盖图","十八台","八苏木","苏集","红砂坝","新安庄","堡子湾","孤山","七苏木","大陆号","贲红","芦家村","白音察干","乌兰哈达","宝拉格","阿贵图","土牧尔台","乌兰花","白银哈尔","巴彦郭勒","德日斯图","朱日和","锡林呼都嘎","赛汗塔拉","楚鲁图","郭尔奔敖包","夏拉哈马","齐哈日格图","查干特格","赛乌苏","西里","锡林浩特","苏尼特左旗","阿巴嘎旗","西乌旗","白音华南","二龙屯","额济纳","包头西","哈业胡同","白彦花","公庙子","乌拉山","西小召","四分滩","头道桥","杭锦旗","碱柜","乌海北","包头北","昆都仑召","瓦窑坝","明安","营盘湾","高家村","石门村","坝梁","西斗铺","老羊壕","艾不盖","乌兰胡同","白云鄂博","新贤城","二道沙河","包头东","华城","汉寿","树木岭","香樟路","湘府路","先锋","芙蓉南","板塘","荷塘","暮云","洞井","昭山","开福寺","观沙岭","八方山","谷山","尖山","麓谷","长沙西","田心东","大丰","株洲南","九郎山","偏岭","松树台","桥北","桥头","新寒岭","五龙背","汤山城","一面山","叆河","石城","天桥沟","雅河","大雅河","桓龙湖","古城子","三十里堡","上安","井陉","南张村","井南","南峪","娘子关","程家","岩会","阳泉","寿阳","芦家庄","韦庄","合阳北","永乐店","三原","阎良","大荔北","礼泉","乾县","永寿","彬州","长武","柞水","砚川","千河","千阳","福临堡","元龙","犀浦","郫县西","彭州","离堆公园","都江堰","襄垣","永济","风陵渡","轩岗","汾河","古东","古交","镇城底","娄烦","岚县","白文东","蔡家崖","高村","平社","豆罗","阳明堡","枣林","下社","大营","东庄","东淤地","平型关","后寨","东坡","西武匠","晋城北","东元庆","北板桥","南陈铺","西阳村","赵庄","长子","小宋","大辛庄","毛坝关","麻柳","巴山","花楼坝","亚布力南","秦家","桃园","女儿河","高桥镇","营北","柳树屯","孔家沟","郭家屯","串子沟","大徐屯","鸽子洞","四家子","杨树湾","杨家店","南桥","建昌","南汤","宣家沟","金杖子","田家沟","任家店","北磴","杨杖子","刀尔登","东营子","东沟门","魏杖子","水泉","裕国","归流河","大石寨","德伯斯","明水河","白狼","兰州东","鸳鸯镇","贺家店","洛门","磐安镇","新阳镇","渭南镇","三阳川","南河川","石岭","白泉","驼腰岭","五道沟","太阳山","红寺堡","黄羊湾","柳家庄","宁东南","宣和","大战场","中宁南","长农","艾家村","石坝","王团庄","土桥子","李旺","韩府湾","七营","褚家湾","三营","二营","沈家河","彭阳","六盘山","三关口","新李","平凉南","大坝","黄羊滩","沙坡头","黑冲滩","土门子","园墩","上腰墩","白银市","吴家川","靖远西","靖远","东湾","新松浦","玉石","芨岭","平原堡","许三湾","绿化","镜铁山","猛洞河","塘豹","锦和","桃映","梅江","暖泉","平罗","大武口","大磴沟","呼鲁斯太","白芨沟","汝箕沟","新安","刘家店","和静","彭州南","步行街","安靖","红光镇","郫县","迎宾路","青城山","安德","燕岗","沙湾","轸溪","刘沟","代湾","杨漩","共和","峨边","柏村","金口河","关村坝","汉源","六个鸡","桐木寨","加劳","宝老山","黄平","水花","蕉溪","青溪","羊坪","高峰","新平坝","化处","关寨","滥坝","梅花山","凉水井","金钟","李子沟","迤那","仙水","花土坡","昭通南","普定","织金","大方南","甲猫","学庄","打羊","峰洞","星朗","朱石寨","纳雍","大关","盐津","水富","宜宾","成都西","羊马","崇州","大邑","邛崃","蒲江","雅安","名山","温江","西来","朝阳湖","海口东","美兰","琼海","陵水","亚龙湾","文昌","博鳌","万宁","神州","老城镇","福山镇","临高南","银滩","白马井","棋子湾","乐东","三亚","黄流","尖峰","崖州","金月湾","凤凰机场","海口东","城西","秀英","长流","道滘","西平西","东城南","寮步","松山湖北","大朗镇","常平南","常平东","樟木头东","银瓶","沥林北","仲恺","惠环","龙丰","西湖东","云山","小金口","黄土店","雁栖湖","黑山寺","官高","北宅","流水沟","猴山","虎什哈","五道河","二道沟门","张百湾","金沟屯","滦河沿","梁底下","白旗","超梁沟","闹海营","韩麻营","窑上","南大庙","河洛营","汤头沟","沙坨子","张三营","东大坝","庙宫","腰栈","广德号","银镇","黄家店","朝阳地","五十家子","杨家营","老府","中台子","牛家营子","红花沟","三把火","曹家营子","承德东","上板城","上板城南","西大庙","新杖子","南湾子","洞庙河","北马圈子","前苇塘","六道河子","统军庄","庙城","高各庄","张辛","潘家店","甲山","永和","榆树沟","上谷","大杖子","神头","平旺","林海","大扬气","石脑","沙海","南洼","二龙","汐子","乃林","平庄南","热水","马林","孤山子","能家","忠工屯","石门子","新绰源","塔尔气","汇流河","图里河","朝中","得耳布尔","莫尔道嘎","哈达","金林","金河","阿龙山","满归","扎罗木得","伊敏索木","德仁","辉河","温根托海","巴日图","道劳杜","罕达盖","杜拉尔","孝南","孝西","白壁关","兑镇","阳泉曲","东镇","西贺村","沙园","孙家","周家","牛家","拉林","背荫河","安家","水洞","道清","老营","东通化","鸭园","铁厂","果松","石湖","老岭","黄柏","西阳岔","阳岔","集安","菇园","林子头","松岭","临江","定襄","河边","神池","五寨","安塘","秦家庄","岢岚","扎赉诺尔","阿乌尼","火炬沟","二岔","影壁山","板石河","柳毛沟","小山","青沟子","刘家河","石人","内江","木镇","双凤驿","迎祥街","隆昌","李市镇","安富镇","广顺场","荣昌","峰高铺","大足","长河碥","双石桥","永川","临江场","柏林","茨坝","朱杨溪","平等","白沙","金刚沱","油溪","古家沱","江津","黄磏","铜罐驿","石场","小南海","茄子溪","重庆南","内江南","大山铺","自贡","俞冲","孔滩","王场","敬梓场","一步滩","宜宾南","横江","小儿坪","铜鼓溪","滩头","普洱渡","临江溪","盐津北","豆沙关","沙沙坡","小关溪","岔河","曾家坪子","苍坪","邓家湾","田梁子","彝良","彝良南","二道桥","昭通北","七龙星","民福寺","夏坝","綦江","三江","镇紫街","赶水","石门坎","木竹河","三元坝","蒙渡","太白","九龙塘","大河坝","新场","元田坝","桐梓","红花园","娄山关","汇塘河","松坝","遵义西","普雄","上普雄","尔赛河","尼波","乐武","红峰","沙马拉达","瓦祖","铁口","新凉","联合乡","喜德","冕山","冕宁","月华","西昌南","德昌","乐跃","蒲坝","永郎","弯坵","米易","枣子林","桐子林","茨冲","庙庄","崇信","桥西","狼尾山","忙罕屯","唐山南","古冶","当雄","曲水县","尼木","仁布","日喀则"]
  let pos = 0;
  while(pos < cs.length){
    if(cs[pos] == city){
      if(pos > 100)
        city = cs[pos - 1];
      break;
    }
    pos += 1;
  }
  // if (city_infos.hasOwnProperty(city)) return [parseFloat(city_infos[city].longitude), parseFloat(city_infos[city].latitude)];
  if (cityInfos.hasOwnProperty(city)) return [parseFloat(cityInfos[city].latitude), parseFloat(cityInfos[city].longitude)];
  return [-1, -1];
}








export function show(dic) {
  console.log(`{name:${dic.name}`);
  console.log(' children:[');
  for (let i = 0; i < dic.children.length; i++) {
    show(dic.children[i]);
  }
  console.log(']');
  console.log('}\n');
}

function findLayerPositionByScaleAndDepth(startPos, scale, dimension='step', set, list, curDepth, maxDepth){
  set.add(startPos);
  if(curDepth >= maxDepth)
    return;
  if(!list.hasOwnProperty(curDepth))
    list[curDepth] = []
  for(const nextPos of Object.keys(info[startPos])){
    if(info[startPos][nextPos][dimension] <= scale && info[startPos][nextPos][dimension] !== 0 && !set.has(nextPos)){
      list[curDepth].push(findPosition(startPos), findPosition(nextPos));
      findLayerPositionByScaleAndDepth(nextPos, scale - info[startPos][nextPos][dimension], dimension, set, list, curDepth + 1, maxDepth);
    }
  }
}

/**
 * 有层的坐标线
 * @param startPos
 * @param scale
 * @param dimension
 * @param maxDepth
 * @returns {{}}
 */
export function findLayerPositionConnections(startPos, scale, dimension='step', maxDepth = 1000){
  let set = new Set();
  let list = {};
  findLayerPositionByScaleAndDepth(startPos, scale, dimension, set, list, 0, maxDepth);
  return list;
}

export function test() {
  const all = findAllConnections();
  const layer = findLayerConnections('盖州', 200, 'time');
  const parcial = findPartialConnections('盖州', 200, 'time');
  console.log(all);
  console.log(layer);
  console.log(parcial);
}


